// тема методы массивов
// что такое массивы?
// массив - это структура данных, которая позволяет хранить несколько значений в одной переменной.
// массивы в JavaScript - это объекты, которые имеют специальные методы для работы с ними.

// map - это метод массива, который позволяет создать новый массив, применяя функцию к каждому элементу исходного массива.
// length - это свойство массива, которое возвращает количество элементов в массиве.
// push - это метод массива, который позволяет добавить один или несколько элементов в конец массива.
// pop - это метод массива, который удаляет последний элемент из массива и возвращает его.
// shift - это метод массива, который удаляет первый элемент из массива и возвращает его.
// unshift - это метод массива, который позволяет добавить один или несколько элементов в начало массива.
// splice - это метод массива, который позволяет удалить элементы из массива и/или добавить новые элементы на определенную позицию.
// reverse - это метод массива, который изменяет порядок элементов в массиве на обратный.
// split - это метод строки, который разделяет строку на массив подстрок, используя указанный разделитель.
// join - это метод массива, который объединяет все элементы массива в строку, используя указанный разделитель.
// filter - это метод массива, который создает новый массив со всеми элементами, которые проходят проверку, задаваемую в передаваемой функции.
// find - это метод массива, который возвращает первое значение в массиве, которое удовлетворяет условию, заданному в передаваемой функции. Если ни один элемент не удовлетворяет условию, возвращается undefined.
// forEach - это метод массива, который выполняет указанную функцию один раз для каждого элемента в массиве.